tests_result/k6/2026-04-26_20-48-28/baseline.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: C:\Users\MSII\cn322waf\tests\performance\k6\baseline.js
        output: json (C:\Users\MSII\cn322waf\tests_result\k6\2026-04-26_20-48-28\baseline_raw.json)

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 8 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  01.0s/50.0s

running (0m02.0s), 01/10 VUs, 17 complete and 0 interrupted iterations
default   [   4% ] 01/10 VUs  02.0s/50.0s

running (0m03.0s), 02/10 VUs, 30 complete and 0 interrupted iterations
default   [   6% ] 02/10 VUs  03.0s/50.0s

running (0m04.0s), 02/10 VUs, 49 complete and 0 interrupted iterations
default   [   8% ] 02/10 VUs  04.0s/50.0s

running (0m05.0s), 02/10 VUs, 67 complete and 0 interrupted iterations
default   [  10% ] 02/10 VUs  05.0s/50.0s

running (0m06.0s), 03/10 VUs, 94 complete and 0 interrupted iterations
default   [  12% ] 03/10 VUs  06.0s/50.0s

running (0m07.0s), 03/10 VUs, 123 complete and 0 interrupted iterations
default   [  14% ] 03/10 VUs  07.0s/50.0s

running (0m08.0s), 04/10 VUs, 154 complete and 0 interrupted iterations
default   [  16% ] 04/10 VUs  08.0s/50.0s

running (0m09.0s), 04/10 VUs, 191 complete and 0 interrupted iterations
default   [  18% ] 04/10 VUs  09.0s/50.0s

running (0m10.0s), 04/10 VUs, 230 complete and 0 interrupted iterations
default   [  20% ] 04/10 VUs  10.0s/50.0s

running (0m11.0s), 05/10 VUs, 275 complete and 0 interrupted iterations
default   [  22% ] 05/10 VUs  11.0s/50.0s

running (0m12.0s), 05/10 VUs, 322 complete and 0 interrupted iterations
default   [  24% ] 05/10 VUs  12.0s/50.0s

running (0m13.0s), 05/10 VUs, 369 complete and 0 interrupted iterations
default   [  26% ] 05/10 VUs  13.0s/50.0s

running (0m14.0s), 05/10 VUs, 410 complete and 0 interrupted iterations
default   [  28% ] 05/10 VUs  14.0s/50.0s

running (0m15.0s), 05/10 VUs, 456 complete and 0 interrupted iterations
default   [  30% ] 05/10 VUs  15.0s/50.0s

running (0m16.0s), 05/10 VUs, 502 complete and 0 interrupted iterations
default   [  32% ] 05/10 VUs  16.0s/50.0s

running (0m17.0s), 06/10 VUs, 557 complete and 0 interrupted iterations
default   [  34% ] 06/10 VUs  17.0s/50.0s

running (0m18.0s), 06/10 VUs, 613 complete and 0 interrupted iterations
default   [  36% ] 06/10 VUs  18.0s/50.0s

running (0m19.0s), 06/10 VUs, 668 complete and 0 interrupted iterations
default   [  38% ] 06/10 VUs  19.0s/50.0s

running (0m20.0s), 06/10 VUs, 723 complete and 0 interrupted iterations
default   [  40% ] 06/10 VUs  20.0s/50.0s

running (0m21.0s), 06/10 VUs, 778 complete and 0 interrupted iterations
default   [  42% ] 06/10 VUs  21.0s/50.0s

running (0m22.0s), 06/10 VUs, 832 complete and 0 interrupted iterations
default   [  44% ] 06/10 VUs  22.0s/50.0s

running (0m23.0s), 07/10 VUs, 894 complete and 0 interrupted iterations
default   [  46% ] 07/10 VUs  23.0s/50.0s

running (0m24.0s), 07/10 VUs, 957 complete and 0 interrupted iterations
default   [  48% ] 07/10 VUs  24.0s/50.0s

running (0m25.0s), 07/10 VUs, 1019 complete and 0 interrupted iterations
default   [  50% ] 07/10 VUs  25.0s/50.0s

running (0m26.0s), 07/10 VUs, 1082 complete and 0 interrupted iterations
default   [  52% ] 07/10 VUs  26.0s/50.0s

running (0m27.0s), 07/10 VUs, 1145 complete and 0 interrupted iterations
default   [  54% ] 07/10 VUs  27.0s/50.0s

running (0m28.0s), 07/10 VUs, 1208 complete and 0 interrupted iterations
default   [  56% ] 07/10 VUs  28.0s/50.0s

running (0m29.0s), 08/10 VUs, 1280 complete and 0 interrupted iterations
default   [  58% ] 08/10 VUs  29.0s/50.0s

running (0m30.0s), 08/10 VUs, 1352 complete and 0 interrupted iterations
default   [  60% ] 08/10 VUs  30.0s/50.0s

running (0m31.0s), 08/10 VUs, 1427 complete and 0 interrupted iterations
default   [  62% ] 08/10 VUs  31.0s/50.0s

running (0m32.0s), 08/10 VUs, 1496 complete and 0 interrupted iterations
default   [  64% ] 08/10 VUs  32.0s/50.0s

running (0m33.0s), 08/10 VUs, 1568 complete and 0 interrupted iterations
default   [  66% ] 08/10 VUs  33.0s/50.0s

running (0m34.0s), 08/10 VUs, 1640 complete and 0 interrupted iterations
default   [  68% ] 08/10 VUs  34.0s/50.0s

running (0m35.0s), 09/10 VUs, 1720 complete and 0 interrupted iterations
default   [  70% ] 09/10 VUs  35.0s/50.0s

running (0m36.0s), 09/10 VUs, 1804 complete and 0 interrupted iterations
default   [  72% ] 09/10 VUs  36.0s/50.0s

running (0m37.0s), 09/10 VUs, 1884 complete and 0 interrupted iterations
default   [  74% ] 09/10 VUs  37.0s/50.0s

running (0m38.0s), 09/10 VUs, 1968 complete and 0 interrupted iterations
default   [  76% ] 09/10 VUs  38.0s/50.0s

running (0m39.0s), 09/10 VUs, 2046 complete and 0 interrupted iterations
default   [  78% ] 09/10 VUs  39.0s/50.0s

running (0m40.0s), 09/10 VUs, 2131 complete and 0 interrupted iterations
default   [  80% ] 09/10 VUs  40.0s/50.0s

running (0m41.0s), 10/10 VUs, 2223 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  41.0s/50.0s

running (0m42.0s), 09/10 VUs, 2304 complete and 0 interrupted iterations
default   [  84% ] 09/10 VUs  42.0s/50.0s

running (0m43.0s), 08/10 VUs, 2380 complete and 0 interrupted iterations
default   [  86% ] 08/10 VUs  43.0s/50.0s

running (0m44.0s), 07/10 VUs, 2443 complete and 0 interrupted iterations
default   [  88% ] 07/10 VUs  44.0s/50.0s

running (0m45.0s), 06/10 VUs, 2499 complete and 0 interrupted iterations
default   [  90% ] 06/10 VUs  45.0s/50.0s

running (0m46.0s), 05/10 VUs, 2533 complete and 0 interrupted iterations
default   [  92% ] 05/10 VUs  46.0s/50.0s

running (0m47.0s), 04/10 VUs, 2565 complete and 0 interrupted iterations
default   [  94% ] 04/10 VUs  47.0s/50.0s

running (0m48.0s), 03/10 VUs, 2593 complete and 0 interrupted iterations
default   [  96% ] 03/10 VUs  48.0s/50.0s

running (0m49.0s), 02/10 VUs, 2613 complete and 0 interrupted iterations
default   [  98% ] 02/10 VUs  49.0s/50.0s

running (0m50.0s), 01/10 VUs, 2623 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  50.0s/50.0s


  █ THRESHOLDS 

    error_rate
    ✓ 'rate<0.05' rate=0.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=18.7ms

    resp_status_403
    ✓ 'count<5' count=0


  █ TOTAL RESULTS 

    checks_total.......: 5248    104.838058/s
    checks_succeeded...: 100.00% 5248 out of 5248
    checks_failed......: 0.00%   0 out of 5248

    ✓ home status 200
    ✓ response time < 1s
    ✓ search_num status 200
    ✓ login_page status 200
    ✓ search_text status 200
    ✓ search_th status 200
    ✓ search_order status 200

    CUSTOM
    error_rate.....................: 0.00%  0 out of 2624
    resp_status_200................: 2624   52.419029/s
    resp_status_403................: 0      0/s
    waf_latency_ms.................: avg=9.39ms   min=3.58ms   med=6.84ms   max=812.28ms p(90)=11.84ms  p(95)=18.7ms

    HTTP
    http_req_duration..............: avg=9.39ms   min=3.58ms   med=6.84ms   max=812.28ms p(90)=11.84ms  p(95)=18.7ms
      { expected_response:true }...: avg=9.39ms   min=3.58ms   med=6.84ms   max=812.28ms p(90)=11.84ms  p(95)=18.7ms
    http_req_failed................: 0.00%  0 out of 2624
    http_reqs......................: 2624   52.419029/s

    EXECUTION
    iteration_duration.............: avg=110.89ms min=103.78ms med=107.77ms max=912.78ms p(90)=114.83ms p(95)=125ms 
    iterations.....................: 2624   52.419029/s
    vus............................: 1      min=1         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 5.6 MB 113 kB/s
    data_sent......................: 283 kB 5.7 kB/s



running (0m50.1s), 00/10 VUs, 2624 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  50s